dh-04/Maxim32550/03BFII-41/03Ref/Examples_MAX32550/uart/src/main.c
/*
 * @file uart/src/main.c
 *
 ******************************************************************************
 * Copyright (C) 2016-2018 Maxim Integrated Products, Inc., All rights Reserved.
 *
 * This software is protected by copyright laws of the United States and
 * of foreign countries. This material may also be protected by patent laws
 * and technology transfer regulations of the United States and of foreign
 * countries. This software is furnished under a license agreement and/or a
 * nondisclosure agreement and may only be used or reproduced in accordance
 * with the terms of those agreements. Dissemination of this information to
 * any party or parties not specified in the license agreement and/or
 * nondisclosure agreement is expressly prohibited.
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 *
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 *
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 ******************************************************************************
 */

 /**
 * @defgroup EX_UART UART Example
 * @{
 *
 *
 * @ingroup MML_Examples
 * @brief This example show you how to configure UART to makes an echo printf with your terminal.
 * @note Set of maximum frequency is already did in function SystemCoreClockUpdate() in system/src/cortexm/_initialize_hardware.c
 *
 * @}
 */

#include <stdio.h>
#include <stdlib.h>
#include "diag/Trace.h"
#include <MAX325xx.h>


#define EX_UART_VERS_MAJOR	<VERSMAJ>
#define EX_UART_VERS_MINOR	<VERSMIN>
#define EX_UART_VERS_PATCH	<VERSPAT>
#define EX_UART_VERSION_STRING	"v" xstr(EX_UART_VERS_MAJOR) "." xstr(EX_UART_VERS_MINOR) "." xstr(EX_UART_VERS_PATCH)

int init_uart(void);

int init_uart(void) {
	int result = COMMON_ERR_UNKNOWN;
	mml_uart_config_t config;

	config.baudrate = 115200;
	config.data_bits = UARTn_CTRL_SIZE_bits8;
	config.flwctrl = UARTn_CTRL_RTSCTSF_disable;
	config.parity = MML_UART_PARITY_NONE;
	config.parity_mode = MML_UART_PARITY_MODE_ONES;
	config.rts_ctl = UARTn_PIN_RTS_lo;
	config.stop_bits = UARTn_CTRL_STOP_stop1;
	result = mml_uart_init(MML_UART_DEV0, config);
	return result;
}

int main(void) {
	int result = COMMON_ERR_UNKNOWN;
	unsigned char data_read = 0;
	/* Initialize UART0 port with default configurations */
	result = init_uart();
	if (NO_ERROR == result) {
		/* Welcome message */
		printf("\nWelcome to Printf Echo Application !\n\n");
		fflush(0);
		printf("\nPlease type a character, press CTRL + C to end the program\n\n");
		fflush(0);
		/* Listening */
		while (data_read != 0x03) {
			scanf("%c", &data_read);
			if (data_read == '\r')
				printf("\n");
			printf("%c", data_read);
			fflush(0);
		}
		printf("End of execution\n");
	}
	return result;
}

#ifdef __SCPA_FWK__
#error "This example does not handle SCPA Target"
#endif //__SCPA_FWK__

#pragma GCC diagnostic pop

